load-testing/stress-test.yml
config:
  target: "https://demo.freequencyapp.com"
  phases:
    # Baseline - establish normal performance (1 min)
    - duration: 60
      arrivalRate: 5
      name: "Baseline"

    # Stress phase - find degradation point (3 min)
    - duration: 180
      arrivalRate: 5
      rampTo: 50
      name: "Stress ramp up"

    # Peak stress - confirm breaking point (2 min)
    - duration: 120
      arrivalRate: 50
      rampTo: 100
      name: "Peak stress"

    # Beyond breaking point - test failure modes (2 min)
    - duration: 120
      arrivalRate: 100
      rampTo: 150
      name: "Beyond breaking point"

    # Recovery test - verify system recovers (1 min)
    - duration: 60
      arrivalRate: 150
      rampTo: 5
      name: "Recovery test"

  # Environment variables for authentication
  variables:
    jwt_token: "{{ $processEnvironment.JWT_TOKEN || 'NO_TOKEN_PROVIDED' }}"

  http:
    timeout: 60
    pool: 20
    headers:
      User-Agent: "Artillery Stress Test"
      Accept: "application/json"

scenarios:
  - name: "High-load API calls"
    weight: 60
    flow:
      - get:
          url: "/api/instruments"
          expect:
            - statusCode: [200, 429, 500, 502, 503]

      - get:
          url: "/api/tags"
          expect:
            - statusCode: [200, 429, 500, 502, 503]

      # Test authenticated endpoints with JWT
      - get:
          url: "/api/sessions"
          headers:
            Authorization: "Bearer {{ jwt_token }}"
          expect:
            - statusCode: [200, 401, 429, 500, 502, 503]

  - name: "Database intensive operations"
    weight: 25
    flow:
      # Test authenticated endpoints with JWT
      - get:
          url: "/api/tasks"
          headers:
            Authorization: "Bearer {{ jwt_token }}"
          expect:
            - statusCode: [200, 401, 429, 500, 502, 503]

      - get:
          url: "/api/musicians"
          headers:
            Authorization: "Bearer {{ jwt_token }}"
          expect:
            - statusCode: [200, 401, 429, 500, 502, 503]

  - name: "Static content under load"
    weight: 15
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: [200, 500, 502, 503]

      - get:
          url: "/health"
          expect:
            - statusCode: [200, 500, 502, 503]